In [1]:
import pandas as pd
import numpy as np

# EDDS Exercise 1
## Data Exploration

In [10]:
data = pd.read_table("ml-100k/u.data", names=["user_id", "item_id", "rating", "timestamp"])
genre = pd.read_table("ml-100k/u.genre", sep="|", names=["genre", "genre_id"])
item = pd.read_table("ml-100k/u.item", sep="|", encoding="ISO-8859-1", names=["movie_id", "movie_title", "release_date", "video_release_date", "imdb_url", "unknown", "action", "adventure", "animation", "children", "comedy", "crime", "documentary", "drama", "fantasy", "film_noir", "horror", "musical", "mystery", "romance", "scifi", "thriller", "war", "western"])
user = pd.read_table("ml-100k/u.user", sep="|", names=["user_id", "age", "gender", "occupation", "zip_code"])

display(user)

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]